# TODO  Напишите функцию count_letters
def count_letters(a):
    a = a.lower()
    ans = {}
    for i in a:
        if i.isalpha():
            if i in ans.keys():
                ans[i] += 1
            else:
                ans[i] = 1
    return ans

# TODO Напишите функцию calculate_frequency
def calculate_freqiency(a):
    n = sum(a.values())
    for i in a.keys():
        a[i] = a[i] / n
    return a

main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""

# TODO Распечатайте в столбик букву и её частоту в тексте
ans = count_letters(main_str)
ans = calculate_freqiency(ans)
for i in ans:
    print(f"{i}: {ans[i]:.2f}")